[
	{
	"Image": "",
	"Title": "Bill Waddell honored at Highlands",
	"SubTitle": "",
	"Date": "April 11, 2024",
	"Text": "Bill Waddell, the chair of the Judge Waddell scholarship committee, was honored at Highlands as an special alum.",
	"Link": "https://www.judgewaddell.org/content/pdf/bw.pdf"
	},
	{
	"Image": "https://ramblinwreck.com/wp-content/uploads/2021/11/IMG_1026-1024x683.jpg",
	"Title": "Homer Rice Statue Unveiled",
	"SubTitle": "Georgia Tech athletics unveiled a statue of legendary director of athletics Homer Rice on Friday.",
	"Date": "January 27, 2022",
	"Text": "Georgia Tech athletics unveiled a statue of legendary director of athletics Homer Rice on Friday. The statue is located on Callaway Plaza, just outside of Bobby Dodd Stadium, and steps from the entrance to Georgia Tech’s Homer Rice Center for Sports Performance. \n\n Rice’s statue is the third to be dedicated on Callaway Plaza, joining sculptures of John Heisman and Bobby Dodd. In addition to being legendary coaches at Georgia Tech, Heisman and Dodd also served as Tech’s director of athletics during their time on The Flats. The most prominent national awards for college football’s player of the year (Heisman), coach of the year (Dodd) and athletics director of the year (Rice) are named in their honor.",
	"Link": "https://ramblinwreck.com/homer-rice-statue-unveiled/"
	},
	{
		"Image": "",
		"Title": "Waddell Scholarship Endowment Doubles",
		"SubTitle": "Updated",
		"Date": "November 23, 2022",
		"Text": "The Ewell “Judge” Waddell Endowed Scholarship Fund has received gifts from the Waddell family that will double the size of the Scholarship’s endowment. According to the Fund’s Chair, William Waddell, $150,000 will be received immediately. The total endowment is now over $300,000, which will permanently fund the current level of spending.\n\nThe Waddell Scholarship was established in 2004 as a tribute to Highlands head football coach and later Superintendent of Ft. Thomas Schools Ewell E. “Judge” Waddell. Coach Waddell was a beloved and respected figure in Ft. Thomas from 1940 until his untimely death in 1967. Recipients of the Scholarship are chosen on the basis of a sincere interest in teaching and coaching, and demonstrated character and leadership ability. More than $50,000 in scholarship awards have been made since the fund’s inception.\n\nDale Mueller, former Highlands coach and athletic director, and member of the Scholarship’s Advisory Committee, said “this scholarship and ones like it are vitally important in encouraging Highlands seniors toward teaching and coaching careers. Our young people deserve the best teacher\/coaches possible, and this is an ingredient in making that happen.” ",
		"Link": ""
	},

{
		"Image": "/content/img/eew_sized.jpg",
		"Title": "Hall of Fame Video",
		"SubTitle": "",
		"Date": "February 8, 2017",
		"Text": "A video created by the Highlands High School  showing some of the background and ceremony images from the Hall of Fame can be seen here ",
		"Link": "http://www.judgewaddell.org/Home/Video?VideoId=VsfLRWV2leY"
	},
	{
		"Image": "/content/img/hof.jpg",
		"Title": "Hall of Fame",
		"SubTitle": "",
		"Date": "January 18, 2017",
		"Text": "In 2016, Coach Waddell was inducted into the Highlands High School Athletic Hall of Fame.  Photographs from the \nceremony can be seen here - [Gallery](http://www.judgewaddell.org/About/HallOfFameGallery)",
		"Link": ""
	},
	{
		"Image": "/assets/img/main/talisman.jpg",
		"Title": "The Judge in the 1934 Talisman",
		"SubTitle": "\n",
		"Date": "January 6, 2017",
		"Text": "Received from [April McCauley](mailto:april.mccauley@wku.edu)\n====\n\nEwell Waddell appears several times in the 1934 Talisman. \n\n He was senior class treasurer. His main entry as a senior is on page 25 of the Talisman.\n\nHe was also in two clubs, on the Talisman staff, played football, and managed basketball. But also found was that he was voted most popular boy. Additional entries for him are on the following pages: 27, 88, 99, 106, 122, 126. \n\n Here is a link to the 1934 Talisman on TopScholar: [http://digitalcommons.wku.edu/dlsc_ua_records/348](http://digitalcommons.wku.edu/dlsc_ua_records/348) Click on the link, then click on \"Download\" on the right side of the screen to go to the scan of the 1934 Talisman.\n\nAdditional documents, including previous years' Talismans are also available on TopScholar. The link below leads to a date-ordered list of documents. Scroll down to get to 1934, and use the numbers and arrows at the very bottom to navigate to earlier years. You can also use the search box in the upper left corner to search for him by name in TopScholar. (Search for \"Ewell Waddell\" and \"Waddell Ewell.\") \n\n[http://digitalcommons.wku.edu/dlsc_ua_records/index.43.html#year_1934](http://digitalcommons.wku.edu/dlsc_ua_records/index.43.html#year_1934)\n\nThere were no collections for the clubs that he was in, but those clubs are mentioned in the Herald and, briefly, in other places. The catalog is also online and can be reached at kencat.wku.edu.\n\nAlso found in the \"humor\" section of the Talisman is this gem from the \"class will\": \n\n![](http://www.judgewaddell.org/Content/img/class-will.png)\n\nThe Judge Waddell advisory board thanks April McCauley for sending us this information! ",
		"Link": ""
	}

]
