[
	{
		"ScholarId": 2020001,
		"Scholar": "Brycen T. Huddleston",
		"Headline": "Brycen T. Huddleston",
		"Year": 2020,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2020 <br>Brycen was a middle linebacker and Team Captain of the football team.  Among his numerous awards he was named team MVP, 1st Team All-State, 1st Team All-Tristate, and Northern KY Defensive Player of the Year and All-Decade Team. In the classroom Brycen excelled as a Super Honor Roll student with a 3.9 GPA.  He also won the Leadership Award, volunteered for the Spring Clean event, was an Assistant Jr. Football Coach, and a Moyer Elementary Hero for 2nd grade students.  Brycen is described as having ‘the highest level of character and integrity that we all want represented in the teaching profession’ and as ‘an advocate for all students… kind to everyone on a daily basis’. \n\n<b>College:</b> Eastern Michigan University <br>Brycen is currently playing varsity football and majoring in Elementary Education. <br>2020 Season- Special Teams Scout Team Player of the Year, 2x Scout Team Player of the Week",
		"Link": ""
	},
	{
		"ScholarId": 2020002,
		"Scholar": "Meghan V. Walz",
		"Headline": "Meghan V. Walz",
		"Year": 2020,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2020 <br>Meghan was an Honor Roll student and four year member of the Basketball program.  She excelled in the classroom as a National Honor Society student with a 3.9 GPA.  Megan was heavily involved in her community and volunteered at the Take Flight Basketball League, Highlands Youth Basketball Camps, Luke Muller Golf Outing, and Highlands Athletics Booster Drive.  Megan is described as ‘kind, ethical, diligent, and well-grounded… not only is she a leader on the court and in the locker room, she is a leader amongst the student body’ and ‘a well-rounded, caring, and responsible young woman… what makes Meghan truly stand out from her peers is her character and drive to better the lives of those around her’. \n\n<b>College:</b> Northern Kentucky University <br>Meghan is currently majoring in Secondary Education with a focus on English and Special Education. She is also a manager for the Northern Kentucky Women's Basketball team.",
		"Link": ""
	},
	{
		"ScholarId": 2019001,
		"Scholar": "Nathaniel Roberts",
		"Headline": "Nathaniel Roberts",
		"Year": 2019,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2019 <br>At various points in his Highlands career, Nathaniel was Mr. Highlands Football, selected as Offensive Dominator, and given the Triple Threat Award. He lettered in three different sports, and maintained a cumulative 3.7 GPA on the academic side. Throughout his years at Highlands, he took part in and led both academic and athletic programs in Special Education. Nathaniel is described as ‘has a natural talent to connect with kids… brought energy, enthusiasm, and a competitive fire with him every day’. \n\n<b>College:</b> University of Kentucky <br>Nathaniel is intent on a career in Special Education as a teacher and coach, and is currently enrolled on that track.",
		"Link": ""
	},
	{
		"ScholarId": 2019002,
		"Scholar": "Will James Salmon",
		"Headline": "Will James Salmon",
		"Year": 2019,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2019 <br>Will personifies the student-athlete profile the Scholarship seeks to support. Twice a football Captain, and recipient of the Red Dog Spirit Award his junior year, Will's teachers, coaches and colleagues all speak of his determination, dedication and plain grit in whatever he takes on.  Will is described as ‘truly embodies our team core value of adding value to the lives of those around you… a completely selfless individual who always puts others first’. \n\n<b>College:</b> Northern Kentucky University <br>He has serious teaching and coaching ambitions, with a particular focus on Special Education.",
		"Link": ""
	},
	{
		"ScholarId": 2017001,
		"Scholar": "Claudia Hils",
		"Headline": "Claudia Hils",
		"Year": 2017,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2017 <br>Claudia was an outstanding student-athlete at Highlands, with a concentration in soccer. She was captain of a nationally-ranked soccer team, lettered three times, and coached an elementary soccer team, all while achieving a straight A academic record and serving in numerous leadership positions in her class and other organizations, including the National Honor Society. Claudia is described as ‘enthusiastic, optimistic, and joyful- the kind of student who can light up a room… a strong desire to make the world a better place’, ‘an excellent example of hard work, determination, perseverance, and pride’, and ‘you would be hard pressed to find another young woman who treats her peers and teachers with as much respect and kindness day in and day out while still being fiercely competitive on the soccer field and in the classroom’. \n\n<b>College:</b> Northern Kentucky University <br>Claudia graduated in December 2020 Summa Cum Laude with a 4.0 GPA and a major in Elementary Education.  While at NKU she held numerous leadership positions in various organizations, such as the Student Government Association, NKU Women’s Club Soccer Team, Delta Zeta sorority, and Norse Leadership Society.  She served as an Orientation Leader to incoming freshman students, a peer mentor to college students with learning disabilities, and was the only student representative on the College of Education Dean Search Committee during the 2019-2020 school year.  In the Fall 2020 she completed her student teaching at Ruth Moyer Elementary in Fort Thomas (4th grade with Mrs. Kelsey Hogberg and Kindergarten with Ms. Annie Goetz). Claudia was honored with the Outstanding Teacher Candidate Award for Elementary Education for the Fall of 2020 from the NKU College of Education. \n\n<b>Post-College:</b> <br>Claudia is currently substitute teaching in Ft. Thomas.",
		"Link": ""
	},
	{
		"ScholarId": 1,
		"Scholar": "McKenzie J. Leigh",
		"Headline": "McKenzie J. Leigh",
		"Year": 2016,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2016 <br>McKenzie was a four-year Super Honor Roll student-athlete at Highlands. She received the Presidential Award for Academic Excellence at Highlands and has the distinction of being a 2015 Kentucky Governor’s Scholar. Among other things at HHS she was a member of National Honor Society, National English Honor Society, National Spanish Honor Society, and Future Business Leaders of America. McKenzie was a three-year starter on the Varsity Girls Basketball team, receiving 5 Varsity letters and being a team captain her senior year. She was named the MVP of the LaRosas Holiday Classic Tournament in 2015 and to the 9th Region All-Tournament team in 2014, 2015, and 2016. In 2015, she received the Highlands High School David Cecil Citizenship Award by a unanimous vote from all the Varsity athletic coaches at Highlands. Combining both athletics and academics, she also received the Northern Kentucky High School Girls Basketball Coaches’ Association Division II Academic Award.  McKenzie is described as ‘the ultimate team player… has the patience and work ethic that will make her a great teacher in the classroom’ and ‘treats all of her peers with the utmost respect and kindness’. \n\n<b>College:</b> University of Kentucky<br>In addition to being named a Waddell Scholar, she received the Presidential Scholarship which covers Full Tuition for four years. McKenzie graduated in 2020 with a degree in Elementary Education and a minor in Spanish. \n\n<b>Post-College:</b> <br>McKenzie is currently a 4th Grade Teacher at Grandview Elementary in Bellevue.  She is also a Varsity Assistant Coach for the Bellevue High School Girls Basketball Team.",
		"Link": ""
	},
	{
		"ScholarId": 2014001,
		"Scholar": "Mallory Seidel",
		"Headline": "Mallory Seidel",
		"Year": 2014,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2014 <br>Mallory was captain of the Highlands varsity volleyball team as a senior, after several standout years in that sport, including being named MVP of her freshman team. Mallory was also a member of the tennis and track teams during her Highland years.  Excellent academic achievement and numerous volunteer commitments rounded out a career that led the Scholarship Committee to name her our 2014 recipient. \n\n<b>College:</b> University of Louisville<br>Mallory graduated in 2018 with an Education degree. During school she continued her great volunteer work with everything from Special Olympics to Habitat for Humanity, and was elected VP of the U of L College of Education for 2016-2017. \n\n<b>Post-College:</b> <br>Mallory is currently a 10th Grade Teacher at Walton-Verona High School.  She completed her Masters in Educational Administration from Xavier University in 2020.",
		"Link": ""
	},	
	{
		"ScholarId": 3,
		"Scholar": "Richie Whitford",
		"Headline": "Richie Whitford",
		"Year": 2013,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2013 <br>Richie played four years of football at Highlands, and was a team Captain in his senior year. Coach Mueller described him as "an inspiration...with regards to how hard he worked and how well he developed and played." His Highlands career also included the Honor Roll, the Super Honor Roll, the Spanish Club and FBLA. Throughout the years he spent countless volunteer hours for the benefit of churches and community on everything from Boosters Club fundraisers to the Soup Kitchen. \n\n<b>College:</b> University of Kentucky \n\n<b>Post-College:</b> <br>Richie currency works as a Preferred Relationship Advisor at Fifth Third Bank.",
		"Link": ""
	},
	{
		"ScholarId": 4,
		"Scholar": "Brian Beck",
		"Headline": "Brian Beck",
		"Year": 2010,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2010 <br>Brian was Mr. Highlands Football three times, and received the Red Dog Spirit Award, but obviously didn't neglect academics, as he made the Super Honor Roll and received the Silver Key Writing Award. \n\n<b>College:</b> Northern Kentucky University <br>During college Brian engaged in student teaching as a part of the COST (Consortium for Overseas Student Teaching) program at a high school in the Netherlands. We are proud to have one of our scholars involved in the vitally-important field of global education. \n\n<b>Post-College:</b> <br>Brian has, at least for now, chosen a sales career in the private sector.",
		"Link": ""
	},
	{
		"ScholarId": 5,
		"Scholar": "Brady Dowling",
		"Headline": "Brady Dowling",
		"Year": 2008,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2008 <br>Brady played center for the Bluebirds football team and was elected captain his senior year. A real leader, Brady was a Freshman and Freshman Football Mentor in 2007-08, and received the Leader of Champions award in 2008. \n\n<b>College:</b> University of Kentucky<br>Brady received his B.A. and Masters Degrees from the University of Kentucky, in English and Educational Administration. He tutored students at Henry Clay High School, worked in the front office of the Lexington Legends (AA) baseball club, and did his student teaching in the Fayette County Public School System, all in and around Lexington. \n\n<b>Post-College:</b> <br>In 2013, he became the first Waddell Scholar to accept a full-time teaching position in the Ft. Thomas system, teaching English and AP English courses at Highlands. He is also Head Freshman Football Coach.  Brady and his wife, Ashley, have two children, Jarrett and Eloise. \n\nWe are proud to have Brady become the first of our scholars to come home to Highlands. In recalling his own formative years, Brady notes the ‘outstanding education the Highlands teachers and staff gave me in preparing me for writing and planning for exams’, as well as the lesson ‘that friends and outside influences are just as important as having a good education. The social experience I had at Highlands...made it a seamless transition from high school to college. Being a part of the football team was also huge for me; football made me mentally and physically tough while also affording me...lifelong friends’.",
		"Link": ""
	},
	{
		"ScholarId": 6,
		"Scholar": "Sydney Hiance",
		"Headline": "Sydney Hiance",
		"Year": 2007,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2007 <br>Sydney starred at soccer at Highlands and at the University of Kentucky as goalkeeper. At Highlands she compiled an incredible record, with a goals against average of 0.20 her senior year, and was named, among other things, Gatorade Kentucky Player of the Year and Cincinnati Enquirer Player of the Year. \n\n<b>College:</b> University of Kentucky<br>Sydney compiled one of the best shutout records in U.K. history. She graduated from U.K. in 2011 with a degree in Elementary Education. \n\n<b>Post-College:</b> <br>Sydney served as a substitute teacher in the Ft. Thomas school system and coached at the prestigious Kings Soccer Academy in Wilder, Kentucky, also finding time for an International Fitness Association (IFA) certification. Sydney is currently a Channel Execution Manager for Schneider Electric.  She manages fifteen Project Managers throughout the East and West coast so does a good deal of ‘teaching’ with them regularly. \n\nWhen we asked how she felt about her Highlands preparation, Sydney said, ‘I think Highlands more than prepared me for my college career both as an athlete and also as a student. It is hard for me to believe that I would be where I am now without the help from the wonderful people at Highlands and especially my soccer coach Nina Kearns’.",
		"Link": ""
	}
]
