[
	{
		"ScholarId": 2020001,
		"Scholar": "Brycen T. Huddleston",
		"Headline": "Brycen T. Huddleston",
		"Year": 2020,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2020 <br>Brycen was a middle linebacker and Team Captain of the football team.  Among his numerous awards he was named team MVP, 1st Team All-State, 1st Team All-Tristate, and Northern KY Defensive Player of the Year and All-Decade Team. In the classroom Brycen excelled as a Super Honor Roll student with a 3.9 GPA.  He also won the Leadership Award, volunteered for the Spring Clean event, was an Assistant Jr. Football Coach, and a Moyer Elementary Hero for 2nd grade students.  Bycen is described as having 'the highest level of character and integrity that we all want represented in the teaching profession' and as 'an advocate for all students… kind to everyone on a daily basis'. \n\n<b>College:</b> Eastern Michigan University <br>Brycen is currently playing varsity football and majoring in Elementary Education. <br>2020 Season- Special Teams Scout Team Player of the Year, 2x Scout Team Player of the Week",
		"Link": ""
	},
	{
		"ScholarId": 2020002,
		"Scholar": "Meghan V. Walz",
		"Headline": "Meghan V. Walz",
		"Year": 2020,
		"Desc": "<b>High School:</b> Highlands High School, Class of 2020 <br>Meghan was an Honor Roll student and four year member of the Basketball program.  She excelled in the classroom as a National Honor Society student with a 3.9 GPA.  Megan was heavily involved in her community and volunteered at the Take Flight Basketball League, Highlands Youth Basketball Camps, Luke Muller Golf Outing, and Highlands Athletics Booster Drive.  Megan is described as 'kind, ethical, diligent, and well-grounded… not only is she a leader on the court and in the locker room, she is a leader amongst the student body' and 'a well-rounded, caring, and responsible young woman… what makes Meghan truly stand out from her peers is her character and drive to better the lives of those around her'. \n\n<b>College:</b> Northern Kentucky University <br>Meghan is currently majoring in Secondary Education with a focus on English and Special Education. She is also a manager for the Northern Kentucky Women's Basketball team.",
		"Link": ""
	},
	{
		"ScholarId": 2019001,
		"Scholar": "Nathaniel Roberts",
		"Headline": "Nathaniel Roberts",
		"Year": 2019,
		"Desc": "At various points in his Highlands career, Nathaniel was Mr. Highlands Football, selected as Offensive Dominator, and given the Triple Threat Award. He lettered in three different sports, and maintained a cumulative 3.7 GPA on the academic side. Throughout his years at Highlands, he took part in and led both academic and athletic programs in Special Education. Nathaniel is intent on a career in Special Education as a teacher and coach, and is currently enrolled on that track at the University of Kentucky.",
		"Link": ""
	},
	{
		"ScholarId": 2019002,
		"Scholar": "Will James Salmon",
		"Headline": "Will James Salmon",
		"Year": 2019,
		"Desc": "Will personifies the student-athlete profile the Scholarship seeks to support. Twice a football Captain, and recipient of the Red Dog Spirit Award  his junior year, Will's teachers, coaches and colleagues all speak of his determination, dedication and plain grit in whatever he takes on. He has serious teaching and coaching ambitions, with a particular focus on Special Education, and is at Northern Kentucky University.",
		"Link": ""
	},
	{
		"ScholarId": 2017001,
		"Scholar": "Claudia Hils",
		"Headline": "Claudia Hils",
		"Year": 2017,
		"Desc": "Claudia was an outstanding student-athlete at Highlands, with a concentration in soccer. She was captain of a nationally-ranked soccer team , lettered three times, and coached an elementary soccer team, all while achieving a straight A academic record and serving in numerous leadership positions in her class and other organizations, including the National Honor Society. She is compiling a similarly impressive record at NKU, holding a number of leadership positions and a 4.0 GPA, and is still very committed to teaching and coaching.",
		"Link": ""
	},
	{
		"ScholarId": 1,
		"Scholar": "McKenzie J. Leigh",
		"Headline": "McKenzie J. Leigh",
		"Year": 2016,
		"Desc": "McKenzie was a four-year Super Honor Roll student-athlete at Highlands. She received the Presidential Award for \nAcademic Excellence at Highlands and has the distinction of being a 2015 Kentucky Governor’s Scholar. Among \nother things at HHS she was a member of National Honor Society, National English Honor Society, National\nSpanish Honor Society, and Future Business Leaders of America.  McKenzie was a three-year starter on the \nVarsity Girls Basketball team, receiving 5 Varsity letters and being a team captain her senior year.  She mas \nnamed the MVP of the LaRosas Holiday Classic Tournament in 2015 and to the 9th Region All-Tournament \nteam in 2014, 2015, and 2016. In 2015, she received the Highlands High School David Cecil Citizenship \nAward by a unanimous vote from all the Varsity athletic coaches at Highlands. Combining both athletics \nand academics, she also received the Northern Kentucky High School Girls Basketball Coaches’ Association \nDivision II Academic Award. \n\nMcKenzie is attending the University of Kentucky, in addition to receiving the E.E. \"Judge\" Waddell Scholarship,\nshe has received the Presidential Scholarship which covers Full Tuition for four years. Her first semester produced\na 3.73 GPA.  \n\nCongratulations!\n",
		"Link": ""
	},
	{
		"ScholarId": 2014001,
		"Scholar": "Mallory Seidel",
		"Headline": "Mallory Seidel",
		"Year": 2014,
		"Desc": "Mallory was captain of the Highlands varsity volleyball team as a senior, after several standout years in that sport, including\nbeing named MVP of her freshman team. Mallory was also a member of the tennis and track teams during her Highland years.  \nExcellent academic achievement and numerous volunteer commitments rouded out a career that led the Scholarship Committee \nto name her our 2014 recipient.  Mallory is currently in her third year at the University of Louisville, working toward an \nEducation degree, continuing her great volunteer work with everything from Special Olympics to Habitat for Humanity, \nand being elected VP of the U of L College of Education for 2016-2017.  ",
		"Link": ""
	},	
	{
		"ScholarId": 3,
		"Scholar": "Richie Whitford",
		"Headline": "Richie Whitford",
		"Year": 2013,
		"Desc": "Richie played four years of football at Highlands, and was a team Captain in his senior year. Coach Mueller described him as \"an inspiration...with regards to how hard he worked and how well he developed and played.\" His Highlands career also included the Honor Roll, the Super Honor Roll, the Spanish Club and FBLA. Throughout the years he spent countless volunteer hours for the benefit of churches and community on everything from Boosters Club fundraisers to the Soup Kitchen.\n\nEducationally, Richie is headed for Elementary Education at the University of Kentucky. Our best wishes to him.",
		"Link": ""
	},
	{
		"ScholarId": 4,
		"Scholar": "Brian Beck",
		"Headline": "Brian Beck",
		"Year": 2010,
		"Desc": "Brian was Mr. Highlands Football three times, and received the Red Dog Spirit Award, but obviously didn't neglect academics, \nas he made the Super Honor Roll and received the Silver Key Writing Award. Brian graduated from Northern Kentucky \nUniversity, and engaged in student teaching as a part of the COST (Consortium for Overseas Student Teaching) program\nat a high school in the Netherlands. \n\nWe are proud to have one of our scholars involved in the vitally-important field of global education.  Brian has, at least for now,\nchosen a sales career in the private sector.",
		"Link": ""
	},
	{
		"ScholarId": 5,
		"Scholar": "Brady Dowling",
		"Headline": "Brady Dowling",
		"Year": 2008,
		"Desc": "Played center for the Bluebirds football team and was elected captain his senior year. A real leader, Brady was a Freshman and Freshman \nFootball Mentor in 2007-08, and received the Leader of Champions award in 2008. Brady received his B.A. and Masters Degrees \nfrom the University of Kentucky, in English and Educational Administration. He tutored students at Henry Clay High School, \nworked in the front office of the Lexington Legends (AA) baseball club, and did his student teaching in the Fayette County \nPublic School System, all in and around Lexington.\n\nIn 2013, he became the first Waddell Scholar to accept a full-time teaching position in the Ft. Thomas system, teaching English and \nAP English courses at Highlands.  He has been head Freshman football coach for the past seven years.  \nWe are proud to have Brady become the first of our scholars to come home to Highlands.\n\nIn recalling his own formative years, Brady notes the \"outstanding education the Highlands teachers and staff gave me in \npreparing me for writing and planning for exams\", as well as the lesson \"that friends and outside influences are just as \nimportant as having a good education. The social experience I had at Highlands...made it a seamless transition from \nhigh school to college. Being a part of the football team was also huge for me; football made me mentally and \nphysically tough while also affording me...lifelong friends\". ",
		"Link": ""
	},
	{
		"ScholarId": 6,
		"Scholar": "Sydney Hiance",
		"Headline": "Sydney Hiance",
		"Year": 2007,
		"Desc": "Sydney starred at soccer at Highlands and at the University of Kentucky as goalkeeper. At Highlands she compiled an incredible record, \nwith a goals against average of 0.20 her senior year, and was named, among other things, Gatorade Kentucky Player of the Year \nand Cincinnati Enquirer Player of the Year. At Kentucky she compiled one of the best shutout records in U.K. history. She \ngraduated from U.K. in 2011 with a degree in elementary education.\n\nShe served as a substitute teacher in the Ft. Thomas school system and coached at the prestigious Kings Soccer \nAcademy in Wilder, Kentucky, also finding time for an International Fitness Association (IFA) certification.  Sydney is currently\npursuing a management career in the private sector, but maintains a strong interest in coaching.\n\nWhen we asked how she felt about her Highlands preparation, Sydney said, \"I think Highlands more than prepared me for my \ncollege career both as an athlete and also as a student. It is hard for me to believe that I would be where I am now without the \nhelp from the wonderful people at Highlands and especially my soccer coach Nina Kearns\". ",
		"Link": ""
	}
]
